Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་ཐམས་ཅད་སྒྲོལ་བགྱིད་པ། །མི་ཟད་སྦུབས་བཤད་ཇི་ལྟ་བར། །སེམས་ཅན་དག་གི་ལས་རྣམས་ཀུན།
en: “This inexhaustible core that was uttered Liberates the entire world And exhausts all the karmic actions of sentient beings;

source: །ཟད་བགྱིད་གཉིས་པ་མ་མཆིས་སོ།
en: There is nothing else like it!

source: །འཁོར་བ་རང་གིས་ལས་གང་དག །བགྱིས་པ་རྣམས་ནི་རིང་དུ་སྤོང་།
en: “It casts far away the karmic actions One has generated in saṃsāra.

source: །སྡུག་བསྔལ་ཀུན་ལས་གྲོལ་འགྱུར་ཞིང་།
en: It liberates from all forms of suffering

source: །བསོད་ནམས་གཟི་བརྗིད་ལྡན་པར་འགྱུར།
en: And delivers splendorous merit.

source: །སྲིད་པའི་རྒྱ་མཚོ་སྐེམས་བགྱིད་ཅིང་།
en: “It dries up the ocean of saṃsāra,

source: །སྡིག་པ་ཐམས་ཅད་འཇོམས་པར་བགྱིད། །
en: It overcomes all negative actions,

source: གང་ན་འདྲེན་པ་བཞུགས་འགྱུར་བའི། །ཞིང་དག་ཏུ་ནི་མྱུར་འགྲོ་བགྱིད།
en: And it swiftly leads to the realms Where the guides reside.

source: །སྡུག་བསྔལ་སྣོད་ཀྱི་འཁོར་བ་ན། །ཉེས་དམིགས་མང་པོ་མཐོང་ནས་ཀྱང་།
en: “After perceiving the many shortcomings Of saṃsāra, the vessel of suffering,

source: །ཉོན་མོངས་ཐམས་ཅད་སེལ་བགྱིད་ཅིང་།
en: All afflictions will be cleared away,

source: །བྱང་ཆུབ་དམ་པ་ཐོབ་པར་འགྱུར།
en: And sublime awakening will be achieved.

source: །སེམས་ཅན་གང་ཚུལ་འདི་ཉན་ན།
en: “If sentient beings listen to this way,

source: །ཐུབ་པར་དཀའ་བར་འགྱུར་བ་ལགས།
en: They will become unassailable.

source: །དེ་བས་བཀུར་སྟི་བགྱིས་ནས་མཉན།
en: Therefore, listening to it respectfully

source: །དཔལ་ཀུན་ཐོབ་པར་བགྱིས་པ་ལགས།
en: Will lead to everything glorious!

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་བདག་གིས་བཟུང་ལགས་ཏེ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བདག་མཆི་ལགས་སོ།
en: “Respected Blessed One, I will remember this great teaching of the inexhaustible core and go to the Sahā world!”

source: །ཡང་དེའི་ཚེ་འཁོར་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་དག་ལས་ལངས་ནས་རིང་པོ་མ་ལོན་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment, the bodhisattva great beings in the retinue arose from their absorption, and before long an innumerable and limitless number of them exclaimed in unison,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། འདུས་པ་ཆེན་པོ་བལྟ་བ་དང་། ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་སྔོན་ཆད་མ་ཐོས་པ་ཉན་པར་འཚལ་ལགས་ན་བཅོམ་ལྡན་འདས་དེར་བདག་ཅག་མཆི་བར་གནང་བར་མཛད་དུ་གསོལ།
en: “Respected Blessed One, we also want to behold the thus-gone Śākyamuni, to pay homage to him, to worship him, to revere him, to behold his great assembly, and to listen to the Dharma teaching of The Quintessence of the Sun, which has never been heard before!

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཐམས་ཅད་ལྷན་ཅིག་འཐུན་པར་བརྒྱ་བྱིན་གྱི་ཆ་བྱད་དང་། སྤྱོད་ལམ་དང་། རྟགས་དང་། དབྱིབས་དག་དང་། དབང་ཕྱུག་ལ་དབང་བས་དེང་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་ཐམས་ཅད་འགྲོགས་ཤིང་འཐུན་པར་བརྒྱ་བྱིན་གྱི་ཆ་བྱད་དང་། སྤྱོད་ལམ་དང་། རྟགས་དང་། དབྱིབས་དག་དང་། དབང་ཕྱུག་ལ་དབང་བར་བདག་ཉིད་མངོན་པར་སྤྲུལ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་དེ་ནས་ཆས་སོ།
en: Blessed One, please allow us to go there!” The thus-gone King of the Lord of Mountains replied, “Noble sons, all of you please proceed together while adopting the attire, behavior, marks, shape, and majestic power of Śakra.” Then, the bodhisattva great being Gandhahastin and all the innumerable and limitless bodhisattva great beings manifested personal emanations with the attire, behavior, marks, shape, and majestic power of Śakra. They prostrated to the feet of the blessed thus-gone King of the Lord of Mountains, circumambulated him three times, and left.

source: །དེ་དག་ཡུད་ཙམ་གྱིས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་ཏེ།
en: In a single instant they arrived in the Sahā world.

source: དེ་དག་ཕྱིན་པའི་མོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་སྤོས་ཀྱི་ཆར་ཆེན་པོ་མངོན་པར་རབ་ཏུ་ཕབ་སྟེ། འདི་ལྟ་སྟེ། ཙན་དན་གོར་ཤིར་ཥ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། ཏ་མ་ལའི་འདབ་མ་དང་། ཨ་ག་རུ་དང་། རྒྱ་སྤོས་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ།
en: As soon as they arrived, in this buddha realm of Sahā they showered a rain of perfumed substances—powders of white sandalwood, uragasāra sandalwood, tamāla tree leaves, aloeswood, Chinese incense, and yellow sandalwood—to worship the blessed Śākyamuni.

source: །དེ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་ཀྱང་ཐམས་ཅད་བརྒྱ་བྱིན་གྱི་ཆ་བྱད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: When, looking like Śakra, they arrived at the place where the thus-gone Śākyamuni was residing, they prostrated to the feet of the Blessed One, circumambulated him three times, and then sat to one side.

source: །ཡང་དེའི་ཚེ་ནུབ་ཕྱོགས་ལོགས་ཀྱི་ཕྱོགས་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན། སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གནས་པ་སྙིང་པོའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་སྙིང་པོའི་རྒྱལ་མཚན་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: Also during that time, in the western direction, beyond buddha realms as numerous as the grains of sand in forty-two Ganges Rivers, there was a buddha realm ripe with the five degenerations called Essence Banner, where thus-gone, worthy, perfect Buddha Royal Mass of Glorious Wisdom was residing.

source: འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: He thrived, lived well, and taught the Dharma to sentient beings and in accordance with the inclinations of the members of his four assemblies.

source: །འཁོར་དེ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་སྙིང་པོ་དཔལ་ཞེས་བྱ་བ་ཆོས་མཉན་པའི་ཕྱིར་འདུས་ཏེ་འདུག་པར་གྱུར་ཏོ། །དེས་ཀྱང་གྱེན་དུ་རྣམ་པར་བལྟས་སོ། །དེས་སྟེང་གི་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ནུབ་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ནས་ཤར་ཕྱོགས་སུ་འགྲོ་བ་དག་མཐོང་ངོ་།
en: A bodhisattva great being named Glorious Essence of Light, who had joined the assembly to listen to the Dharma, looked upward and saw in the sky above an innumerable and limitless number of bodhisattva great beings departing from the west and proceeding toward the east.

source: །དེས་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འདོང་བའི་ཤར་ཕྱོགས་ལ་རྣམ་པར་བལྟས་ཏེ།
en: When he looked in the eastern direction, where those bodhisattva great beings were going, he saw a brilliant light.

source: དེས་དེར་སྣང་བ་ཆེན་པོ་མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་ལ་ཡོངས་སུ་ཞུས་སོ་ཞེས་བྱ་བ་ནས། དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་སྙིང་པོ་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་དང་། རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་ནས་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གནས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ། དེ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: He then questioned the thus-gone Royal Mass of Glorious Wisdom, who replied to him, “Noble son, in the eastern direction, beyond buddha realms as numerous as the grains of sand in forty-two Ganges Rivers, in a place ripe with the five degenerations, there is a world called Sahā, where the blessed Buddha, the thus-gone Śākyamuni, resides, thrives, lives well, and teaches the Dharma.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ་ཞེས་བྱ་བའི་བར་དང་། དེའི་ཚེ་དེ་ན་འདུས་པ་ཆེན་པོ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་ཀྱི་ཚུལ་དང་དཀོན་མཆོག་གསུམ་གྱི་གདུང་རིང་དུ་གནས་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱིས་གནས་པ་ཉིད་རྒྱུན་མི་གཅད་པའི་ཕྱིར་དང་། བདུད་ཀྱི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་མཛད་པའི་ཕྱིར་ཐེག་པ་གསུམ་རྣམ་པར་གཏན་ལ་དབབ་པ་བསྟན་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་སྟོན་ཏོ།
en: At this time, there is in that place a great assembly in which that thus-gone one reveals Dharma teachings that are the gateways to the ascertainment of the three vehicles, to ensure that the Dharma way and the lineage of the Three Jewels endure for a long time, to ensure that those who abide by the Dharma remain without interruption, to destroy the domain of the māras, and to raise the banner of the Dharma.

source: །དེར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཤེགས་ནས་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བའི་གཟུངས་སྔགས་བཤད་ནས་ཀྱང་དེ་དག་གཤེགས་པར་མཛད་དོ།
en: There, all the thus-gone ones have recited the dhāraṇī mantra called jewel crest and then left.

source: །ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་འདུས་པ་ཆེན་པོ་ཡང་དག་པར་འདུས་པར་མཛད་དེ། དེར་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ལྡན་པའི་སྤྱན་གསུམ་དང་།
en: The thus-gone Śākyamuni has gathered a great assembly of bodhisattva great beings and hearers who possess the three eyes that are endowed with the four correct knowledges and who display the sublime states.

source: ཚངས་པའི་གནས་པ་དག་བསྟན་ཀྱང་ད་དུང་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ས་དང་ནམ་མཁའི་ལམ་ཐམས་ཅད་མ་འདྲེས་པར་གང་བ་ཞིག་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྙན་པར་གསུང་བ་ཤཱཀྱ་ཐུབ་པའི་ཆོས་བསྟན་པས་ངོམས་པ་མེད་དོ་ཞེས་བྱ་བའི་བར་ཇི་ལྟར་སྔར་གསུངས་པ་བཞིན་ཏེ།
en: This retinue distinctly fills the earth and the sky of the buddha realm of Sahā, and it is insatiable with respect to the Dharma teachings of the thus-gone Śākyamuni, who is endowed with the most delightful voice.

source: རིགས་ཀྱི་བུ་ཁྱོད་ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཞུ་བའི་ཕྱིར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་སྤྲོ་ན། དེར་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་ལ་ངས་དད་པ་སྦྱིན་པར་མཛད་དོ།
en: “Noble son, if you would like to bring my words to the Sahā world in order to convey them to the thus-gone Śākyamuni, I shall instill faith there in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: །དེར་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ། འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ།
en: There, I will confer this powerful and beneficial acceptance that accords with the absence of wishes.

source: གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས། ཟད་པ་ཤེས་པ་སྐྱེད་པའི་བར་བྱེད་པ། མི་སྐྱེ་བ་ཤེས་པ་རྟོགས་པར་བྱེད་པ། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བྱེད་པ། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པ་འདི་བསྐུར་བར་མཛད་དོ། །
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realms, as well as all forms of pride, special pride, and pride that thinks ‘I am.’ [. . .] It generates the knowledge of exhaustion, causes one to realize the knowledge of the unborn, overcomes all the dense darkness of ignorance, and removes the burden of suffering.

source: ཏད་ཡ་ཐཱ། ཤ་ན་ཤ་བ། མ་ཤ་ན་ཤ་བ། ཨ་བཀྵ་ཤ་བ། ཀྵུ་ཀྵུ་ཏ་ཤ་བ། ཙཀྵུ་ཤ་བ། ཤྲོ་ཏྲ་ཤ་བ། གྷྲཱ་ཎ་ཤ་བ། ཛི་ཧྭ་ཤ་བ། ཀཱ་ཡ་ཤ་བ། མ་ན་ཤ་བ། ཀྵུ་བྷ་བི་དྷ། ཙཀྵུ་པྲ་ཏི་བི་ཤ་བ། ཤྲོ་ཏྲ་ཨ་བྷ་ཀྵ་བྷ། གྷྲཱ་ཎ་ཏེ་ཛ་ཀྵ་བྷ། ཛི་ཧྭ་བཱ་ཡུ་ཀྵ་བྷ། ཀཱ་ཡ་ཀྲ་མ་ཀྵ་བྷ། མ་ན་ཨོ་ཛ། ཨཱ་ལོ་ཀ་ཛྙཱ་ཡཀྵ་བྷ། བཱི་ཛ་སང་ཀྲ་མ་ཀྵ་བྷ། ཨང་ག་ར་ཁ་ག་ཀྵ་བྷ། ས་མཱ་རོ་པ་བྱ་ཡཀྵ་བྷ། ཤ་མ་ཀ་ན་ཀྵ་བྷ། ཀྵ་ཡ་ཀ་ར་ས་ཀྵ་བྷ། ཤཱ་ན་ཏ་བྱ་ཏྱ་སྠ་ཀྵབྷ། ན་ཏོ་ཏཻ་ཏ་ཏོ་ན། ཨ་ཙ་ནཻ་ན་ན་ཏོ་ན། ན་གྷ་བ་ན་ཡི་ན་ཏོ་ན། ཨེ་ཤ་ཨེ་བཱན་ཏོ་དུ་ཁ་སྱ་སྭཱ་ཧཱ།
en: tadyathā: śanaśava maśanaśava avakṣaśava kṣukṣutaśava cakṣaśava śrotraśava ghrāṇaśava jihvaśava kāyaśava manaśava kṣubhavidha cakṣuprativiśava śrotra abhakṣabha ghrāṇatejakṣabha jihvavāyukṣabha kāyakramakṣabha manoja āloka­jñāyakṣabha vījasaṅkramakṣabha aṅgarakhagakṣabha samāropa­vyayakṣabha śamakankṣabha kṣayakarasakṣabha śāntavyahyasthakṣabha natotaitatona acanainanatona naghavanayinatona eśa evāntodukhasya svāhā.

source: རིགས་ཀྱི་བུ་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་དེ་ནི་འདི་ཡིན་ཏེ།
en: “Noble son, this is the dhāraṇī mantra that accords with the absence of wishes.

source: མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ། འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས། སྡུག་བསྔལ་གྱི་ཁུར་ཐམས་ཅད་འདོར་བར་བྱེད་པའི་བར་ཡིན་ནོ།
en: It is powerful and beneficial, it exhausts all forms of attachment associated with the desire realm and the form realm, [. . .] and it removes the entire burden of suffering.

source: །ལོང་ལ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་ཤིག །
en: Take it with you, and go to the Sahā world!

source: ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་། བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་ཞུས་ལ།
en: Convey my words to the thus-gone Śākyamuni and ask him if he has any ills or problems and whether he is healthy and well.

source: དེ་ལ་འདི་སྐད་དུ་ནུབ་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གནས་པ། སྙིང་པོའི་རྒྱལ་མཚན་ཞེས་བགྱི་བ་མཆིས་སོ། །སངས་རྒྱས་ཀྱི་ཞིང་སྙིང་པོའི་རྒྱལ་མཚན་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བགྱི་བ་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: Tell him, ‘In the western direction, beyond buddha realms as numerous as the grains of sand in forty-two Ganges Rivers, there is a buddha realm ripe with the five degenerations called Essence Banner, where the thus-gone, worthy, perfect Buddha Royal Mass of Glorious Wisdom resides, lives well, and teaches the Dharma to sentient beings and in accordance with the inclinations of the members of his four assemblies.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་སྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ངམ།
en: “Respected Blessed One, are you well and free from ills?

source: ཁྱོད་ཀྱི་འཁོར་བྲོ་འཚལ་བ་མ་མཆིས་ལགས་སམ།
en: Are the members of your retinue in good health?

source: འདིར་ཁྱོད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཐོགས་པ་མ་མཆིས་པར་སྐོར་བར་མཛད་ལགས་སམ། གང་ལ་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་འདིར་ཆོས་མ་ལགས་པའི་འཁོར་ལོ་སྐོར་བ་དེའི་སླད་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་དེས་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་འདི་ལ་དད་པར་སྩོལ་བར་མཛད་ཅིང་།
en: Are you turning the Dharma wheel without obstruction in this place?” For those who turn a wheel of non-Dharma in this buddha realm, the thus-gone, worthy, perfect Buddha Royal Mass of Glorious Wisdom instills faith by granting the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, this dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: དེ་ནས་ཀྱང་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: He also confers this powerful and beneficial dhāraṇī mantra that accords with the absence of wishes.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས་སྡུག་བསྔལ་གྱི་ཁུར་ཐམས་ཅད་འདོར་བར་བྱེད་པ་འདི་དེས་བསྐུར་ལགས་སོ་ཞེས་བྱ་བའི་བར་གསོལ་ཅིག་ཅེས་བྱ་བ་སྔ་མ་བཞིན་ནོ།
en: It exhausts all forms of attachment associated with the desire realm and the form realm, [. . .] and it removes the entire burden of suffering.’ ”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་སྙིང་པོ་དཔལ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་ཕན་ཡོན་བདག་གིས་བཟུང་ལགས་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་མཆི་བ་ལ་འཇིགས་པ་འབའ་ཞིག་མཆིས་ལགས་སོ།
en: The bodhisattva great being Glorious Essence of Light then said, “Respected Blessed One, when I consider the benefits of this dhāraṇī mantra that accords with the absence of wishes, I am very afraid of going to the buddha realm of Sahā!

source: ད་ལྟར་བཅོམ་ལྡན་འདས་ལ་བདག་གིས་མངོན་དུ་ཐོས་ཤིང་མངོན་དུ་ཡོངས་སུ་བཟུང་ལགས་ཏེ།
en: Because I have heard and understood what the Blessed One said:

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་སེམས་ཅན་རྣམས་མཆོག་ཏུ་ལྟ་བ་མི་ཟད་པས་སྡུག་བསྔལ་ཐོབ་པར་གྱུར་པ་མཆོག་ཏུ་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བ།
en: in that buddha realm of Sahā, sentient beings experience intense suffering due to their improper views;

source: དམུས་ལོང་དང་འདྲ་བ་དག་ལགས་ཏེ་ཞེས་བྱ་བ་ནས། བུད་མེད་ཀྱི་ཉེས་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པ་དག་དང་། ཡུད་ཙམ་ཁོ་ནས་མནར་མེད་པར་འཆི་བར་འགྱུར་བའི་སླད་དུའོ་ཞེས་བྱ་བའི་བར་སྔ་མ་བཞིན་ནོ།
en: they are predominantly under the influence of intense desire and are like blind persons; [. . .] due to the faults of women, all roots of virtue will deteriorate, and beings will be born instantly in the Hell of Unceasing Torment.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་སྙིང་པོ་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Royal Mass of Glorious Wisdom replied to the bodhisattva great being Glorious Essence of Light,

source: །རིགས་ཀྱི་བུ་ལན་ཐོབ་ཤིག་ལན་ཐོབ་ཤིག །
en: “Answer these questions, noble son, answer these questions!

source: འོ་ན་ཁྱོད་ཀྱིས་ཞག་དགུ་ལ་གླིང་བཞི་པ་བར་མའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་གི་ཆ་བྱད་ཀྱིས་རྒྱ་མཚོ་ཆེན་པོར་ཀླུ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་འཇིགས་པར་ཀུན་ཏུ་བསྟན་པའི་རྐྱེན་གྱིས་སྐྱབས་གསུམ་དུ་འགྲོ་བ་ལ་རྣམ་པར་མ་བཀོད་དམ།
en: In the buddha realm of Sahā, in the great ocean between the four continents, have you not established six hundred forty million nāgas into the practice of taking the threefold refuge by displaying the frightening appearance of a garuḍa, the king of birds, for nine days?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དུ་མ་བཅུག་གམ། དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Have you not caused them to give rise to the mind set on unsurpassed and perfect awakening?”

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ།
en: “Respected Blessed One, that is correct.

source: །ཇི་སྐད་གསུངས་པ་དེ་ལྟ་ལགས་ཏེ།
en: I did as you have just said.

source: བདག་གིས་ཀླུ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་པོ་དེ་དག་འཇིགས་པར་ཀུན་ཏུ་བསྟན་པའི་རྐྱེན་གྱིས་བྱང་ཆུབ་ཀྱི་བར་ལ་རབ་ཏུ་བཀོད་ལགས་སོ།
en: I have indeed established sixty hundred forty million nāgas in that practice, until awakening, by displaying a frightening appearance.”

source: །རིགས་ཀྱི་བུ་འོ་ན་ཁྱོད་ཀྱིས་གླིང་བཞི་པ་བར་མ་དེ་ན་གང་ན་ཆར་པ་མེད་པ་དེར་གང་བསྟན་པ་ལས་དེ་ན་གནས་པའི་ཀླུ་ཐམས་ཅད་འཁྲུག་པར་འགྱུར་ཞིང་། དེ་དག་འཁྲུགས་ནས་ཀྱང་ཞག་བདུན་དུ་ཆར་པ་མངོན་པར་རབ་ཏུ་འབེབས་པར་བྱེད་པའི་གླང་པོ་ཆེའི་ཀླུ་ཆེན་པོ་དག་དང་། རྟའི་ཀླུ་ཆེན་པོ་དང་། སྦྲུལ་གྱི་ཀླུ་ཆེན་པོ་དག་མ་བསྟན་ཏམ། དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “Well then, noble son, in the middle of the four continents, in the place where no rain was falling and all the nāgas had become distressed, did you not manifest as great elephant-nāgas, great horse-nāgas, and great snake-nāgas showering down rains for seven days?”

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་ཏེ།
en: “Respected Blessed One, that is correct.

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་བྱེ་བྲག་གིས་ལགས་སོ།
en: I did that due to my specific past aspirations.”

source: །བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། ངས་ཁྱོད་དེར་མངགས་ན་དེ་ཇི་ལྟར་ཁྱོད་དངང་བར་བྱེད།
en: “Then why are you nervous to be sent there by me?” the Blessed One continued.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་ཞིག་མཆིས་པར་གྱུར་ལ། དེ་ནས་སྐྱེས་བུ་མཁས་པའི་རང་བཞིན་ཅན་ལ་ལ་དེར་མཆིས་ནས་སེན་མོ་དག་གིས་རྐོ་བར་བགྱིད་ན་དེ་ཇི་ལྟ་ཇི་ལྟར་སེན་མོ་དག་གིས་རྐོ་བར་བགྱིད་པ་དེ་ལྟ་དེ་ལྟར་རིན་པོ་ཆེའི་ཕུང་པོ་ཆེན་པོ་ཆེས་མང་དུ་རྙེད་པར་འགྱུར་རོ།
en: The bodhisattva replied, “Respected Blessed One, when a skilled person encounters a great treasure of gems and starts digging with his fingernails, the more he or she digs, the more he or she will discover large amounts of jewels.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་དུ་མཁས་པས་དེ་བཞིན་གཤེགས་པའི་གཏེར་ཡང་ཚིག་དེ་ལྟ་བུ་དག་གིས་ཇི་ལྟ་ཇི་ལྟར་ཕྱུང་བ་དེ་ལྟ་དེ་ལྟར་དེ་ནས་ཆོས་རིན་པོ་ཆེ་རིན་ཐང་མ་མཆིས་པ་ཆེས་ཕལ་ཆེར་འཐོབ་པར་འགྱུར་ལགས་པས་དེར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་ཆོས་ཀྱི་ཕྱག་རྒྱ་གང་གིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་སྐྱེད་པས།
en: Respected Blessed One, in the same way, the more a skilled person extracts the thus-gone ones’ treasure by means of such words, the more that person will gain huge amounts of invaluable Dharma gems.

source: དེར་བདག་གིས་སེམས་ཅན་ཆེས་མང་པོ་ཡོངས་སུ་སྨིན་པར་བགྱིད་པའི་ཆོས་ཀྱི་ཕྱག་རྒྱ་ཆེས་མང་དུ་དེ་བཞིན་གཤེགས་པ་ལས་བདག་ཡོངས་སུ་ཚོལ་བར་བགྱིད་ལགས་སོ།
en: Therefore, in order to ripen beings in that place, I am now seeking from the Thus-Gone One great amounts of Dharma seals that can generate the thus-gone ones’ power, so that I may ripen a huge number of these beings.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བའི་སྙིང་པོ་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ངས་ལུང་བསྟན་པ་ཆེན་པོ་རིག་སྔགས་ཀྱི་རྟེན་ཅེས་བྱ་བ་ཁྱོད་ལ་སྦྱིན་པར་མཛད་དོ།།
en: The thus-gone Royal Mass of Glorious Wisdom then said to the bodhisattva great being Glorious Essence of Light, “Noble son, I confer upon you what is known as the great teaching of the fundamental knowledge mantra:

source: ཏད་ཡ་ཐཱ། ས་ཏྲི་ར་ཎ་ཤ་མ། ས་མུ་ད་ཐཱ་ན་ཤ་མ། ཨ་བརྫ་ན་ཤ་མ། སྭ་རྃ་ག་ཤ་ས་མ། སྃ་ཡོ་ག་ཤ་མ། བན་དྷ་ན་ཤ་མ། ས་མ་བི་ས་ར་ཤ་མ། བཱ་ཏཱི་ན་ཤ་མ། ས་མཱ་ཀྲ་མ་ཤ་མ། ཨ་བིདྱཱ་ཤ་མ། སྃ་སྐཱ་ར་ཤ་མ། བི་ཛྙཱ་ན་ཤ་མ། ནཱ་མ་རཱུ་པ་ཤ་མ། ཥ་ཌཱ་ཡ་ཏ་ན་ཤ་མ། སྤརྴ་ཤ་མ། བེ་ད་ན་ཤ་མ། ཏྲྀཥྞཤ་མ། ཨུ་པཱ་ད་ན་ཤ་མ། བྷ་བ་ཤ་མ། ཛཱཏི་ཤ་མ། ཛ་རཱ་མ་ར་ཎ་ཤ་མ། ཡཱ་བད་སརྦ་མ་ནུ་ཥྱ་ཤ་མ། ཡཱ་བད་སརྦ་ཏྲཻ་དྷཱ་ཏུ་ཀསྃ་སྐྲྀཏ་ཤ་མ། ཨཱ་ར་པཱ་ར་ཤ་མ།
en: tadyathā: striraṇaśama samudthānaśama avarjanaśama svaraṁgaśasama saṁyogaśama bandhanaśama samavisaraśama vātīnaśama samākramśama avidyāśama saṃskāraśama vijñānaśama nāmarūpaśama ṣaḍāyatanaśama sparśaśama vedanaśama tṛṣṇaśama upādanaśama bhavaśama jātiśama jarāmaraṇaśama yāvadsarvamanuṣyaśama yāvadsarvatraidhātuka­saṁskṛtaśama ārapāraśama.

source: འདི་ནི་རིག་སྔགས་ཀྱི་རྟེན་ལུང་སྟོན་པ་ཆེན་པོ་ཡིན་ཏེ།
en: “This is the great teaching of the fundamental knowledge mantra.

source: ལུང་བསྟན་པ་དེས་ན་དེར་སེམས་ཅན་རྣམས་ཀྱིས་ཐོས་པ་ཙམ་གྱིས་སྲེད་པ་ཆུང་ངུ་དང་། འབྲིང་དང་། རབ་དང་། སྲིད་པའི་རྒྱུ་ཉོན་མོངས་པ་རྣམས་རབ་ཏུ་ཞི་བར་འགྱུར་ཞིང་གཟུགས་དང་། གཟུགས་མེད་པའི་སྲིད་པའི་རྒྱུ་བྱེད་པའི་ཉོན་མོངས་པ་རྣམས་རབ་ཏུ་ཞི་བར་འགྱུར་བ་ཡིན་ནོ།
en: In that place, merely by hearing that great teaching, the lesser, moderate, and intense cravings of sentient beings and their afflictions that are the cause of saṃsāra will be completely pacified, as will their afflictions that act as the causes of rebirth in the form and formless realms.

source: །ཉོན་མོངས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་བསྙིལ་བར་འགྱུར་རོ། །འགྲོ་བ་ལྔ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་སྔོན་ཆད་བྱས་པ་འབྲས་བུ་མཐར་མ་ཕྱིན་པ་དང་མ་སྦྱངས་པ་ཐམས་ཅད་ཀྱང་ལྡོག་པར་འགྱུར་རོ།
en: All their afflictions, as numerous as the grains of sand in the Ganges, will be pulverized, and all the physical, verbal, and mental negativities of the five classes of beings that they have accumulated so far—those that have not yet reached full fruition and those that have not been purified—will be counteracted.
